package main

// вывод будет от 1 до 9, и затем произойдет deadlock
// проблема в том, что после завершения отправки всех десяти значений, мы не закрываем канал,
// и for n := range ch всё ещё ждёт, когда же ему отправят значение, но этого не произойдет, так как нет сигнал того, что канал закрыт

func main() {
	ch := make(chan int)
	go func() {
		for i := 0; i < 10; i++ {
			ch <- i
		}
		close(ch) // исправить это можно, просто закрыв канал. Вставляем строку с закрытием только после отправки всех горутин!
	}()

	// так же можно обойтись и без закрытия канала, просто указав точное количество число чтения из канала (то есть 10)
	// for n := 0; n < 10; n++ {
	for n := range ch {
		println(n)
	}
}
