package main

import "fmt"

func test() (x int) {
	// defer функция вызывается перед завершение программы этой функции, то есть return
	defer func() {
		x++
	}()

	// присваиваем x значени 1
	x = 1

	// перед завершенеим вызывается отложенная функция defer, в которой присваиваем единичку x
	return // вывод будет: 2
}

func anotherTest() int {
	// создаем функцию x
	var x int
	defer func() {
		x++
	}()

	// присваиваем x значени 1
	x = 1
	return x // возвращаем копию x, хоть и в defer увеличиваем на единичку, но на результат это никак не влияет
}

// основное отличие вывода в том, что в фунции test мы возвращаем именованную переменную,
// а в функции anotherTest возвращаем значение типа int
func main() {
	fmt.Println(test())        // вывод: 2
	fmt.Println(anotherTest()) // вывод: 1
}
