package main

import (
	"fmt"
)

func main() {
	var s = []string{"1", "2", "3"} // создаём массив типа string, с len и cap = 3.
	modifySlice(s)
	fmt.Println(s) // Вывод: ["3", "2", "3"]
}

// Обратим внимание, что слайс передаем в функцию по значению.
// И при этом мы знаем, что под капотом есть параметр ссылки на на массив.
func modifySlice(i []string) {
	// Так вот, пока слайс не переполнен, любые изменения внутри функции, буду отражаться и на базовом слайсе тоже
	i[0] = "3"

	// Но начиная с момента, как мы добавим новый элемент, произойдет переполнение слайса, и будет создан новый слайс, с увелечением cap в два раза
	// Поэтому дальнейшие изменения или добавления никак не скажутся на базовом слайсе, так как работаем уже с другим слайсом.
	i = append(i, "4") // ["3", "2", "3", "4"], len = 4, cap = 6
	i[1] = "5"         // ["3", "5", "3", "4"], len = 4, cap = 6
	i = append(i, "6") // ["3", "5", "3", "4", "6"], len = 5, cap = 6
}
